# StairsTriserRiserNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTriserRiserNumber Property
ParameterTypeId Class See Also
---
"Riser Number": Count the sequential number of riser in the stair.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTriserRiserNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTriserRiserNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTriserRiserNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace